Repository: JiahaoAlbus/YNX-Chain
Catalog: apps/mail/native/ios/YNXMail/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, ja, ko, pt, ru, zh_hans, zh_hant

# sign_in
source: Sign in with YNX Wallet
ar: تسجيل الدخول باستخدام YNX Wallet
de: Mit YNX Wallet anmelden
es: Iniciar sesión con YNX Wallet
fr: Se connecter avec YNX Wallet
id: Masuk dengan YNX Wallet
ja: YNX Walletでサインイン
ko: YNX Wallet으로 로그인
pt: Entrar com YNX Wallet
ru: Войти через YNX Wallet
zh_hans: 登录 YNX 钱包
zh_hant: 登入 YNX Wallet

source: Inbox
ar: البريد الوارد
de: Posteingang
es: Bandeja de entrada
fr: Boîte de réception
id: Kotak masuk
ja: 受信トレイ
ko: 받은편지함
pt: Caixa de entrada
ru: Входящие
zh_hans: 收件箱
zh_hant: 收件匣

# search
source: Search mail
ar: البحث في البريد
de: E-Mails suchen
es: Buscar correo
fr: Rechercher
id: Cari email
ja: メールを検索
ko: 메일 검색
pt: Pesquisar e-mail
ru: Поиск почты
zh_hans: 搜索邮件
zh_hant: 搜尋郵件

source: Compose
ar: إنشاء رسالة
de: Verfassen
es: Redactar
fr: Rédiger
id: Tulis
ja: 作成
ko: 작성
pt: Escrever
ru: Написать
zh_hans: 写邮件
zh_hant: 撰寫

source: Drafts
ar: المسودات
de: Entwürfe
es: Borradores
fr: Brouillons
id: Draf
ja: 下書き
ko: 임시보관함
pt: Rascunhos
ru: Черновики
zh_hans: 草稿
zh_hant: 草稿

source: Archive
ar: الأرشيف
de: Archiv
es: Archivar
fr: Archiver
id: Arsip
ja: アーカイブ
ko: 보관
pt: Arquivo
ru: Архив
zh_hans: 归档
zh_hant: 封存

source: Spam
ar: البريد المزعج
fr: Indésirables
ja: 迷惑メール
ko: 스팸
ru: Спам
zh_hans: 垃圾邮件
zh_hant: 垃圾郵件

# offline
source: Offline — changes stay on this device
ar: غير متصل — تبقى التغييرات على هذا الجهاز
de: Offline — Änderungen bleiben auf diesem Gerät
es: Sin conexión: los cambios permanecen en este dispositivo
fr: Hors ligne — les modifications restent sur cet appareil
id: Offline — perubahan tetap di perangkat ini
ja: オフライン — 変更はこの端末に保存されます
ko: 오프라인 — 변경 사항은 이 기기에 저장됩니다
pt: Offline — as alterações ficam neste dispositivo
ru: Нет сети — изменения остаются на устройстве
zh_hans: 离线——更改保存在此设备
zh_hant: 離線——變更保留在此裝置

# empty
source: No messages yet
ar: لا توجد رسائل
de: Keine Nachrichten
es: No hay mensajes
fr: Aucun message
id: Belum ada pesan
ja: メッセージはありません
ko: 메시지가 없습니다
pt: Nenhuma mensagem
ru: Сообщений нет
zh_hans: 暂无邮件
zh_hant: 尚無郵件

source: Retry
ar: إعادة المحاولة
de: Erneut versuchen
es: Reintentar
fr: Réessayer
id: Coba lagi
ja: 再試行
ko: 다시 시도
pt: Tentar novamente
ru: Повторить
zh_hans: 重试
zh_hant: 重試

# privacy
source: Only selected threads are sent to AI after approval.
ar: لا تُرسل إلى الذكاء الاصطناعي إلا المحادثات المحددة وبعد الموافقة.
de: Nur ausgewählte Unterhaltungen werden nach Freigabe an die KI gesendet.
es: Solo los hilos seleccionados se envían a la IA tras la aprobación.
fr: Seules les conversations sélectionnées sont envoyées à l’IA après approbation.
id: Hanya percakapan yang dipilih yang dikirim ke AI setelah persetujuan.
ja: 承認後、選択したスレッドだけをAIに送信します。
ko: 승인 후 선택한 대화만 AI로 전송됩니다.
pt: Somente conversas selecionadas são enviadas à IA após aprovação.
ru: Только выбранные цепочки отправляются ИИ после подтверждения.
zh_hans: 仅在批准后将所选会话发送给 AI。
zh_hant: 只有在核准後才會將所選討論串傳送給 AI。

# ai
source: AI workspace
ar: مساحة عمل الذكاء الاصطناعي
de: KI-Arbeitsbereich
es: Espacio de IA
fr: Espace IA
id: Ruang kerja AI
ja: AIワークスペース
ko: AI 작업 공간
pt: Espaço de IA
ru: Рабочая область ИИ
zh_hans: AI 工作区
zh_hant: AI 工作區

# ai_language
source: AI output language
ar: لغة مخرجات الذكاء الاصطناعي
de: KI-Ausgabesprache
es: Idioma de salida de IA
fr: Langue de sortie de l’IA
id: Bahasa keluaran AI
ja: AI出力言語
ko: AI 출력 언어
pt: Idioma de saída da IA
ru: Язык ответа ИИ
zh_hans: AI 输出语言
zh_hant: AI 輸出語言

# approve
source: Approve selected context
ar: الموافقة على السياق المحدد
de: Ausgewählten Kontext freigeben
es: Aprobar contexto seleccionado
fr: Approuver le contexte sélectionné
id: Setujui konteks yang dipilih
ja: 選択した内容を承認
ko: 선택한 컨텍스트 승인
pt: Aprovar contexto selecionado
ru: Подтвердить выбранный контекст
zh_hans: 批准所选上下文
zh_hant: 核准所選內容

# recover
source: Recover with YNX Wallet
ar: الاسترداد باستخدام YNX Wallet
de: Mit YNX Wallet wiederherstellen
es: Recuperar con YNX Wallet
fr: Récupérer avec YNX Wallet
id: Pulihkan dengan YNX Wallet
ja: YNX Walletで復旧
ko: YNX Wallet으로 복구
pt: Recuperar com YNX Wallet
ru: Восстановить через YNX Wallet
zh_hans: 使用 YNX 钱包恢复
zh_hant: 使用 YNX Wallet 復原

# unavailable
source: Gateway unavailable
ar: البوابة غير متاحة
de: Gateway nicht verfügbar
es: Gateway no disponible
fr: Passerelle indisponible
id: Gateway tidak tersedia
ja: ゲートウェイを利用できません
ko: 게이트웨이를 사용할 수 없음
pt: Gateway indisponível
ru: Шлюз недоступен
zh_hans: 网关不可用
zh_hant: 閘道無法使用

# security
source: Wallet approval never shares recovery material.
ar: موافقة المحفظة لا تشارك مواد الاسترداد مطلقًا.
de: Die Wallet-Freigabe gibt niemals Wiederherstellungsmaterial weiter.
es: La aprobación de Wallet nunca comparte material de recuperación.
fr: L’approbation Wallet ne partage jamais les données de récupération.
id: Persetujuan Wallet tidak pernah membagikan materi pemulihan.
ja: Walletの承認で復旧情報が共有されることはありません。
ko: Wallet 승인은 복구 자료를 공유하지 않습니다.
pt: A aprovação da Wallet nunca compartilha material de recuperação.
ru: Подтверждение Wallet никогда не раскрывает данные восстановления.
zh_hans: 钱包批准绝不会共享恢复材料。
zh_hant: 錢包核准絕不會分享復原資料。

# attachment
source: Add attachment (10 MB limit)
ar: إضافة مرفق (حد 10 م.ب)
de: Anhang hinzufügen (max. 10 MB)
es: Añadir archivo adjunto (límite de 10 MB)
fr: Ajouter une pièce jointe (limite 10 Mo)
id: Tambah lampiran (batas 10 MB)
ja: 添付ファイルを追加（上限10 MB）
ko: 첨부 파일 추가(10 MB 제한)
pt: Adicionar anexo (limite de 10 MB)
ru: Добавить вложение (до 10 МБ)
zh_hans: 添加附件（上限 10 MB）
zh_hant: 加入附件（上限 10 MB）

# send_preview
source: Review and send
ar: المراجعة والإرسال
de: Prüfen und senden
es: Revisar y enviar
fr: Vérifier et envoyer
id: Tinjau dan kirim
ja: 確認して送信
ko: 검토 후 보내기
pt: Revisar e enviar
ru: Проверить и отправить
zh_hans: 检查并发送
zh_hant: 檢查並傳送

# a11y_nav
source: Mail navigation
ar: التنقل في البريد
de: E-Mail-Navigation
es: Navegación de correo
fr: Navigation de la messagerie
id: Navigasi email
ja: メールナビゲーション
ko: 메일 탐색
pt: Navegação de e-mail
ru: Навигация по почте
zh_hans: 邮件导航
zh_hant: 郵件導覽

source: Thread
ar: المحادثة
de: Unterhaltung
es: Conversación
fr: Conversation
id: Percakapan
ja: スレッド
ko: 대화
pt: Conversa
ru: Цепочка
zh_hans: 会话
zh_hant: 討論串

# delivery_failure
source: Delivery failed — draft retained
ar: فشل التسليم — تم الاحتفاظ بالمسودة
de: Zustellung fehlgeschlagen — Entwurf behalten
es: Error de entrega: se conservó el borrador
fr: Échec de livraison — brouillon conservé
id: Pengiriman gagal — draf dipertahankan
ja: 配信に失敗しました — 下書きを保持しました
ko: 전송 실패 — 임시보관함에 유지됨
pt: Falha na entrega — rascunho mantido
ru: Сбой доставки — черновик сохранён
zh_hans: 投递失败——草稿已保留
zh_hant: 投遞失敗——草稿已保留

source: Block sender
ar: حظر المرسل
de: Absender blockieren
es: Bloquear remitente
fr: Bloquer l’expéditeur
id: Blokir pengirim
ja: 送信者をブロック
ko: 보낸 사람 차단
pt: Bloquear remetente
ru: Заблокировать отправителя
zh_hans: 屏蔽发件人
zh_hant: 封鎖寄件者

# report_trust
source: Report to Trust
ar: الإبلاغ إلى Trust
de: An Trust melden
es: Denunciar a Trust
fr: Signaler à Trust
id: Laporkan ke Trust
ja: Trustに報告
ko: Trust에 신고
pt: Denunciar ao Trust
ru: Сообщить в Trust
zh_hans: 向 Trust 举报
zh_hant: 向 Trust 檢舉

# appeal
source: Appeal report
ar: استئناف البلاغ
de: Meldung anfechten
es: Apelar denuncia
fr: Contester le signalement
id: Ajukan banding laporan
ja: 報告に異議申し立て
ko: 신고 이의 제기
pt: Contestar denúncia
ru: Обжаловать жалобу
zh_hans: 申诉举报
zh_hant: 申訴檢舉
